app/ViewComposers/BestProductsComposer.php

    public function compose(View $view)
    {
        $bestProductIds = Order::get()->map->products->flatten()->map->pivot->mapToGroups(function ($pivot) {
            return [$pivot->product_id => $pivot->count];
        })->map->sum()->sortByDesc(null)->take(12)->keys()->toArray();

        $bestProducts = Product::whereIn('id', $bestProductIds)->get();
---
select * from `orders`
select * from `products` where `id` in (3, 6, 4, 13, 7, 10) and `products`.`deleted_at` is null