app/Http/Controllers/BasketController.php

select * from `orders` where `orders`.`id` = 22 limit 1
---
    public function basket()
    {
        $orderId = session('orderId');

        if (!is_null($orderId)){
            $order=Order::findOrFail($orderId);

insert into `orders` (`updated_at`, `created_at`) values ('2022-05-18 19:32:24', '2022-05-18 19:32:24')
select * from `orders` where `orders`.`id` = 23 limit 1
select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 23 and `product_id` = '2' limit 1
update `order_product` set `count` = 3, `order_product`.`updated_at` = '2022-05-18 19:33:43' where `order_id` = 23 and `product_id` = 2
insert into `order_product` (`created_at`, `order_id`, `product_id`, `updated_at`) values ('2022-05-18 19:32:26', 23, '2', '2022-05-18 19:32:26')
update `orders` set `user_id` = 1, `orders`.`updated_at` = '2022-05-18 19:32:26' where `id` = 23
select * from `products` where `products`.`id` = '2' limit 1
---
    public function basketAdd($productId)
    {
        $orderId = session('orderId');
        if (is_null($orderId)) {
            $orderId = Order::create()->id;
            session(['orderId' => $orderId]);
        } else {
            $order = Order::find($orderId);
        }
        if ($order->products->contains($productId)){
            $pivotRow = $order->products()->where('product_id',$productId)->first()->pivot;
            $pivotRow->count++;
            $pivotRow->update();
        } else{
            $order->products()->attach($productId);
        }

    if (Auth::check()){
        $order->user_id=Auth::id();
        $order->save();
    }
        $product = Product::find($productId);

select * from `orders` where `orders`.`id` = 23 limit 1
select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 23 and `product_id` = '2' limit 1
delete from `order_product` where `order_product`.`order_id` = 22 and `order_product`.`product_id` in ('1')
update `order_product` set `count` = 1, `order_product`.`updated_at` = '2022-05-18 19:33:47' where `order_id` = 23 and `product_id` = 2
select * from `products` where `products`.`id` = '2' limit 1
---
    public function basketRemove($productId){
        $orderId = session('orderId');
        if ( is_null($orderId)){
            return redirect()->route('basket');
        }
        $order = Order::find($orderId);

        if ($order->products->contains($productId)){
            $pivotRow = $order->products()->where('product_id',$productId)->first()->pivot;
            if ($pivotRow->count < 2){
                $order->products()->detach($productId);
            } else{
                $pivotRow->count--;
                $pivotRow->update();
            }
            $product = Product::find($productId);