app/Http/Controllers/MainController.php

    public function category($code)
    {
        $category = Category::where('code', $code)->first();
---
select * from `categories` where `code` = 'mobiles' limit 1