app/Http/Controllers/MainController.php

select * from `categories` where `categories`.`id` in (1)
select * from `products` where `products`.`deleted_at` is null limit 6 offset 0
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function index(ProductFilterRequest $request)
    {
        $productsQuery = Product::with('category');

        DebugBar::info($request->has('price_from'));
        if ($request->filled('price_from')) {
            DebugBar::info('price_from');
            $productsQuery->where('price', '>=', $request->price_from);
        }

        if ($request->filled('price_to')) {
            $productsQuery->where('price', '<=', $request->price_to);
        }
        foreach (['hit', 'new', 'recommend'] as $field) {
            if ($request->has($field)) {
                $productsQuery->$field();
            }
        }

        $products = $productsQuery->paginate(6)->withPath("?" . $request->getQueryString());

select * from `categories` where `categories`.`id` in (1)
select * from `products` where `products`.`deleted_at` is null limit 6 offset 0
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function main(ProductFilterRequest $request) {
        $productsQuery = Product::with('category');

        DebugBar::info($request->has('price_from'));
        if ($request->filled('price_from')) {
            DebugBar::info('price_from');
            $productsQuery->where('price', '>=', $request->price_from);
        }

        if ($request->filled('price_to')) {
            $productsQuery->where('price', '<=', $request->price_to);
        }
        foreach (['hit', 'new', 'recommend'] as $field) {
            if ($request->has($field)) {
                $productsQuery->$field();
            }
        }

        $products = $productsQuery->paginate(6)->withPath("?" . $request->getQueryString());

select * from `products` where `code` = 'glyphicons-halflings-regular.woff2' limit 1
---
    public function product($category, $productCode) {
        $product = Product::withTrashed()->byCode($productCode)->firstOrFail();