app/Models/Order.php

select `products`.*, `order_product`.`order_id` as `pivot_order_id`, `order_product`.`product_id` as `pivot_product_id`, `order_product`.`count` as `pivot_count`, `order_product`.`created_at` as `pivot_created_at`, `order_product`.`updated_at` as `pivot_updated_at` from `products` inner join `order_product` on `products`.`id` = `order_product`.`product_id` where `order_product`.`order_id` = 9
---
    public function calculateFullSum()
    {
        $sum = 0;
        foreach ($this->products()->withTrashed()->get() as $product) {

update `orders` set `status` = 1, `name` = 'Карпов Илья Владимирович', `phone` = '+79031601390', `orders`.`updated_at` = '2022-05-27 23:19:56' where `id` = 9
---
   public function saveOrder($name,$phone)
   {
       if ($this->status ==0){

           $this->name = $name;
           $this->phone= $phone;
           $this->status=1;
           $this->save();