app/Http/Controllers/Admin/CategoryController.php

    public function index()
    {
        $categories=Category::paginate(10);
---
select * from `categories` limit 10 offset 0
select count(*) as aggregate from `categories`