app/Http/Controllers/Person/OrderController.php

    public function index()
    {
        $orders =Auth::user()->orders()->where('status',1)->paginate(10);
---
select * from `orders` where `orders`.`user_id` = 3 and `orders`.`user_id` is not null and `status` = 1 limit 10 offset 0
select count(*) as aggregate from `orders` where `orders`.`user_id` = 3 and `orders`.`user_id` is not null and `status` = 1